BAS BMEKZU Project/src/Enums/ВидыОперацийРКО/ВидыОперацийРКО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийРКО</name>
  <enumValues>
    <name>ОплатаПоставщику</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ВозвратДенежныхСредствПокупателю</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ВыдачаДенежныхСредствПодотчетнику</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ВыплатаЗаработнойПлатыПоВедомостям</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ВыплатаЗаработнойПлатыРаботнику</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ВзносНаличнымиВБанк</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>РасчетыПоКредитамИЗаймамСКонтрагентами</name>
  </enumValues>
  <enumValues>
    <name>ИнкассацияДенежныхСредств</name>
  </enumValues>
  <enumValues>
    <name>РасходДенежныхСредствПрочее</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ИНАГРО_ВыплатаПаевПоВедомостям</name>
  </enumValues>
  <enumValues>
    <name>ИНАГРО_ВыплатаПаяПайщику</name>
  </enumValues>
  <enumValues>
    <name>ИНАГРО_ДругиеВыплаты</name>
  </enumValues>
  <enumValues>
    <name>Удалить_ИНАГРО_ВыплатаЗаработнойПлатыРаботникам</name>
  </enumValues>
</mdclass:Enum>

BAS BMEKZU Project/src/Enums/ВидыОперацийРКО/ManagerModule.bsl
// ИНАГРО++
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора         = ПолучитьДоступныеЗначения(Параметры.Отбор, Параметры.СтрокаПоиска).ДоступныеЗначения;
	
КонецПроцедуры

#КонецОбласти 

#Область ПрограммныйИнтерфейс

Функция ПолучитьСписокДоступныхЗначений(Отбор, ЕстьНедоступные = Ложь) Экспорт
	
	СтруктураДоступныхЗначений = ПолучитьДоступныеЗначения(Отбор, Неопределено);
	
	ЕстьНедоступные = СтруктураДоступныхЗначений.ЕстьНедоступные;
	
	Возврат СтруктураДоступныхЗначений.ДоступныеЗначения;
	
КонецФункции

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

// Функция выполняет заполнение списка значений 
// данных выбора с учетом настроек параметров учета.
// Поддерживается параметр отбора.
// Обрабатывается также строка поиска.
//
Функция ПолучитьДоступныеЗначения(Отбор, СтрокаПоиска)
	
	Исключения = Новый Массив;
		
	Если НЕ ИНАГРО_ОбщийВызовСервераПовтИсп.ЕстьБСПУ() Тогда
		Исключения.Добавить(Перечисления.ВидыОперацийРКО.ИНАГРО_ВыплатаПаевПоВедомостям);
		Исключения.Добавить(Перечисления.ВидыОперацийРКО.ИНАГРО_ВыплатаПаяПайщику);
		Исключения.Добавить(Перечисления.ВидыОперацийРКО.ИНАГРО_ДругиеВыплаты);
		Исключения.Добавить(Перечисления.ВидыОперацийРКО.Удалить_ИНАГРО_ВыплатаЗаработнойПлатыРаботникам);
	КонецЕсли;
	
	ДоступныеЗначения = Новый СписокЗначений;
	ЕстьНедоступные   = Ложь;
	
	Для каждого ЗначениеПеречисления Из Метаданные.Перечисления.ВидыОперацийРКО.ЗначенияПеречисления Цикл
		
		Если ТипЗнч(СтрокаПоиска) = Тип("Строка")
			И НЕ ПустаяСтрока(СтрокаПоиска)
			И Найти(НРег(ЗначениеПеречисления.Синоним), НРег(СтрокаПоиска)) <> 1 Тогда
			Продолжить;
		КонецЕсли;
		Ссылка = Перечисления.ВидыОперацийРКО[ЗначениеПеречисления.Имя];
		Если ТипЗнч(Отбор) = Тип("ПеречислениеСсылка.ВидыОперацийРКО")
			И Отбор <> Ссылка Тогда
			Продолжить;
		ИначеЕсли ТипЗнч(Отбор) = Тип("ФиксированныйМассив")
			И Отбор.Найти(Ссылка) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Если Исключения.Найти(Ссылка) <> Неопределено Тогда
			ЕстьНедоступные = Истина;
			Продолжить;
		КонецЕсли;
		ДоступныеЗначения.Добавить(Ссылка, ЗначениеПеречисления.Синоним);
		
	КонецЦикла;
	
	Возврат Новый Структура("ДоступныеЗначения,ЕстьНедоступные", ДоступныеЗначения, ЕстьНедоступные);
	
КонецФункции

#КонецОбласти 

#КонецЕсли
// ИНАГРО--
